testdata/IN_2023_02/Roundtrip/produkt/rente/bpr/20220825_bpr_risikoportfolio_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:kapanl-basis="http://www.bipro.net/namespace/kapitalanlage/basis" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      
  <SOAP-ENV:Body>
            
    <tarif:getOffer>
                  
      <tarif:Request>
                        
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                        
        <tarif:Angebot>
                              
          <gevo:Vermittler>
                                    
            <allg:PartnerID>483988448</allg:PartnerID>
                                    
            <allg:Vermittlerrolle>
                                          
              <allg:ArtID>01</allg:ArtID>
                                          
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
                                      
            </allg:Vermittlerrolle>
                                
          </gevo:Vermittler>
                              
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                                    
            <partner:PartnerID>483988448</partner:PartnerID>
                                
          </tarif:Partner>
                              
          <tarif:Partner xsi:type="partner:CT_Person">
                                    
            <basis:Erweiterung xsi:type="vb-leben:CT_PersonErweiterung"/>
                                    
            <partner:Anrede>1</partner:Anrede>
                                    
            <partner:PartnerID>1727106388</partner:PartnerID>
                                    
            <partner:Anschrift>
                                          
              <allg:Landname>Deutschland</allg:Landname>
                                          
              <partner:ArtID>1</partner:ArtID>
                                      
            </partner:Anschrift>
                                    
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
                                          
              <pm-leben:Nichtraucher>true</pm-leben:Nichtraucher>
                                      
            </partner:ZusaetzlichePartnerdaten>
                                    
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risikopruefung">
                                          
              <pm-leben:Fragenkomplex>
                                                
                <fragen:ArtID xsi:type="dt:STE_FragenkomplexArtBasis">Gesundheit</fragen:ArtID>
                                                
                <fragen:Bezeichnung>Gesundheitsfragen zur versicherten Person</fragen:Bezeichnung>
                                                
                <fragen:Element xsi:type="fragen:CT_FrageJaNein">
                                                      
                  <fragen:Ordnungsnummer>2349</fragen:Ordnungsnummer>
                                                      
                  <fragen:FachlicheID>A25</fragen:FachlicheID>
                                                      
                  <fragen:TechnischeID>VP.A25</fragen:TechnischeID>
                                                      
                  <fragen:Text>Haben Sie in den letzten 12 Monaten aktiv Nikotin durch Rauchen oder Inhalieren zu sich genommen (z. B. über Zigaretten, Zigarren, Pfeifen, Shishas, E-Zigaretten, E-Zigarren, E-Pfeifen, E-Shishas)?</fragen:Text>
                                                      
                  <fragen:FreitextErlaubt>false</fragen:FreitextErlaubt>
                                                      
                  <fragen:AntwortJaNein>
                                                            
                    <fragen:Entscheidung>false</fragen:Entscheidung>
                                                        
                  </fragen:AntwortJaNein>
                                                  
                </fragen:Element>
                                            
              </pm-leben:Fragenkomplex>
                                      
            </partner:ZusaetzlichePartnerdaten>
                                    
            <partner:Bankverbindung>
                                          
              <partner:Einzugsermaechtigung>true</partner:Einzugsermaechtigung>
                                      
            </partner:Bankverbindung>
                                    
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                                    
            <partner:Geschlecht>1</partner:Geschlecht>
                                    
            <partner:Berufstaetigkeit>
                                          
              <partner:Beruf>Fachinformatiker</partner:Beruf>
                                          
              <partner:StellungImBeruf xsi:type="dt:STE_StellungImBerufBasis">01</partner:StellungImBeruf>
                                          
              <partner:NichtKoerperlichTaetig>80</partner:NichtKoerperlichTaetig>
                                      
            </partner:Berufstaetigkeit>
                                    
            <partner:Einkommen>
                                          
              <partner:AnzahlGehaelterProJahr>12.0</partner:AnzahlGehaelterProJahr>
                                          
              <partner:Einkommen/>
                                      
            </partner:Einkommen>
                                    
            <partner:Ausbildung>
                                          
              <partner:ArtID xsi:type="dt:STE_AusbildungsartBasis">BeruflicheAusbildung</partner:ArtID>
                                      
            </partner:Ausbildung>
                                
          </tarif:Partner>
                              
          <tarif:Versicherungsnehmer>
                                    
            <partner:PartnerID>1727106388</partner:PartnerID>
                                
          </tarif:Versicherungsnehmer>
                              
          <tarif:Verkaufsprodukt>
                                    
            <basis:Erweiterung xsi:type="vb-leben:CT_VerkaufsproduktErweiterung">
                                          
              <vb-leben:Konsortium>Ohne</vb-leben:Konsortium>
                                      
            </basis:Erweiterung>
                                    
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                                          
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                                                
                <vb-leben:Tarifgruppe>Normal</vb-leben:Tarifgruppe>
                                                
                <vb-leben:Beitragsrendite>
                                                      
                  <vb-leben:Fondskostenberuecksichtigungsart>PAUSCHAL</vb-leben:Fondskostenberuecksichtigungsart>
                                                      
                  <vb-leben:Fondskostenberuecksichtigung>false</vb-leben:Fondskostenberuecksichtigung>
                                                  
                </vb-leben:Beitragsrendite>
                                            
              </basis:Erweiterung>
                                          
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                                          
              <pm:Beitrag>
                                                
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                                
                <pm:Betrag>
                                                      
                  <allg:Betrag>200</allg:Betrag>
                                                      
                  <allg:Waehrung>EUR</allg:Waehrung>
                                                  
                </pm:Betrag>
                                                
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                            
              </pm:Beitrag>
                                          
              <pm:Versicherungsdauer>
                                                
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                                            
              </pm:Versicherungsdauer>
                                          
              <pm:Kennung>BPR</pm:Kennung>
                                          
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                                                
                <basis:Erweiterung xsi:type="vb-leben:CT_RenteErweiterung">
                                                      
                  <vb-leben:Ablaufmanagement>
                                                            
                    <allg:AnzahlJahre>0</allg:AnzahlJahre>
                                                        
                  </vb-leben:Ablaufmanagement>
                                                      
                  <vb-leben:TodesfallleistungImBezug>Keine</vb-leben:TodesfallleistungImBezug>
                                                      
                  <vb-leben:BasisrenteDaten>
                                                            
                    <vb-leben:VorgabeartTodesfallsumme>Keine</vb-leben:VorgabeartTodesfallsumme>
                                                        
                  </vb-leben:BasisrenteDaten>
                                                  
                </basis:Erweiterung>
                                                
                <pm:Versicherungsdauer>
                                                      
                  <allg:AnzahlJahre>35</allg:AnzahlJahre>
                                                      
                  <allg:AnzahlMonate>11</allg:AnzahlMonate>
                                                  
                </pm:Versicherungsdauer>
                                                
                <pm:Dynamik>
                                                      
                  <pm:Wert>0</pm:Wert>
                                                      
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                                                  
                </pm:Dynamik>
                                                
                <vs-pm:VersicherungssummeOderLeistung>
                                                      
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                                      
                  <vs-pm:Wertschluessel xsi:type="vb-leben:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                                                      
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                                      
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                                      
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                                  
                </vs-pm:VersicherungssummeOderLeistung>
                                                
                <vs-pm:FondsPortfolio>
                                                      
                  <vs-pm:Portfoliobezeichnung xsi:type="vb-leben:STE_PortfoliobezeichnungRisikoErweitert">RisikoPortfolio5</vs-pm:Portfoliobezeichnung>
                                                      
                  <vs-pm:Phase>Aufschubphase</vs-pm:Phase>
                                                  
                </vs-pm:FondsPortfolio>
                                                
                <vs-pm:Bezugsrecht>
                                                      
                  <vs-pm:Leistungsfall>Todesfall</vs-pm:Leistungsfall>
                                                      
                  <vs-pm:IndexBerechtigter>3</vs-pm:IndexBerechtigter>
                                                  
                </vs-pm:Bezugsrecht>
                                                
                <pm-leben:Hochrechnungszins>6</pm-leben:Hochrechnungszins>
                                                
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                                
                <pm-leben:UeberschussverwendungNachLeistung xsi:type="dt:STE_UeberschussverwendungBasis">14</pm-leben:UeberschussverwendungNachLeistung>
                                                
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                                                
                <pm-leben:VersichertePerson>
                                                      
                  <partner:PartnerID>1727106388</partner:PartnerID>
                                                  
                </pm-leben:VersichertePerson>
                                                
                <pm-leben:Ablaufmanagement>false</pm-leben:Ablaufmanagement>
                                            
              </pm:Elementarprodukt>
                                          
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                                
                <basis:Erweiterung xsi:type="vb-leben:CT_ArbeitskraftAbsicherungErweiterung">
                                                      
                  <vb-leben:NachversicherungsgarantieBU>0.0</vb-leben:NachversicherungsgarantieBU>
                                                      
                  <vb-leben:Antragsdaten>
                                                            
                    <vb-leben:NichtEUStaatsangehoeriger>false</vb-leben:NichtEUStaatsangehoeriger>
                                                        
                  </vb-leben:Antragsdaten>
                                                  
                </basis:Erweiterung>
                                                
                <vs-pm:VersicherungssummeOderLeistung>
                                                      
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                                      
                  <vs-pm:Wert>300</vs-pm:Wert>
                                                      
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                                      
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                                      
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                                  
                </vs-pm:VersicherungssummeOderLeistung>
                                                
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                                                
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">08</pm-leben:UeberschussverwendungVorLeistung>
                                                
                <pm-leben:VersichertePerson>
                                                      
                  <partner:PartnerID>1727106388</partner:PartnerID>
                                                  
                </pm-leben:VersichertePerson>
                                                
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                                                
                <pm-leben:Auspraegung xsi:type="dt:STE_UnfaehigkeitsZusatzAuspraegungBasis">BU</pm-leben:Auspraegung>
                                                
                <pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>false</pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>
                                            
              </pm:Elementarprodukt>
                                          
              <pm-leben:VorgabeBerechnung>
                                                
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                                
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                                            
              </pm-leben:VorgabeBerechnung>
                                      
            </pm:Produkt>
                                
          </tarif:Verkaufsprodukt>
                              
          <tarif:Beitragszahler>
                                    
            <partner:PartnerID>1727106388</partner:PartnerID>
                                
          </tarif:Beitragszahler>
                          
        </tarif:Angebot>
                    
      </tarif:Request>
              
    </tarif:getOffer>
        
  </SOAP-ENV:Body>
  
</SOAP-ENV:Envelope>
